Repository: walsoup/Fichegen
Catalog: src/FicheGen.App/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, fr_fr

# SP_DownloadWebView2Btn.Content
source: Download WebView2 runtime ↗
ar_sa: تنزيل مكون WebView2 ↗
fr_fr: Télécharger le runtime WebView2 ↗

# Settings_Temp_Precise
source: Precise and reliable
ar_sa: دقيق وموثوق
fr_fr: Précis et fiable

# Settings_Temp_Balanced
source: Balanced
ar_sa: متوازن
fr_fr: Équilibré

# Settings_Temp_Creative
source: Creative
ar_sa: إبداعي
fr_fr: Créatif

# Settings_Temp_VeryCreative
source: Highly creative
ar_sa: إبداعي للغاية
fr_fr: Très créatif

# Settings_KeyCleared
source: Key cleared — remember to save (Ctrl+S).
ar_sa: تم مسح المفتاح — تذكر الحفظ (Ctrl+S).
fr_fr: Clé effacée — pensez à enregistrer (Ctrl+S).

# Settings_NeverTested
source: Never tested
ar_sa: لم يتم الاختبار بعد
fr_fr: Jamais testé

# Settings_TestingInProgress
source: Testing in progress…
ar_sa: جارٍ الاختبار…
fr_fr: Test en cours…

# Settings_ConnectedLatency
source: Connected at {0} ms
ar_sa: متصل في {0} مللي ثانية
fr_fr: Connecté à {0} ms

# Settings_MissingApiKey
source: Missing API key — cannot test
ar_sa: مفتاح API مفقود — تعذر الاختبار
fr_fr: Clé d'API manquante — test impossible

# Settings_MissingServerUrl
source: Server address required
ar_sa: عنوان الخادم مطلوب
fr_fr: Adresse du serveur requise

# Settings_MissingVertexProject
source: Google Cloud Project ID required
ar_sa: معرف مشروع Google Cloud مطلوب
fr_fr: Identifiant du projet Google Cloud requis

# Settings_TesterUnavailable
source: Connection tester unavailable.
ar_sa: أداة اختبار الاتصال غير متاحة.
fr_fr: Testeur de connexion indisponible.

# Settings_CheckingStartup
source: Checking startup status…
ar_sa: جارٍ التحقق من حالة بدء التشغيل…
fr_fr: Vérification de l'état du démarrage…

# Settings_StartupEnabled
source: Enabled (starts automatically)
ar_sa: مفعل (بدء تلقائي)
fr_fr: Activé (démarrage automatique)

# Settings_StartupDisabled
source: Disabled
ar_sa: معطل
fr_fr: Désactivé

# Settings_StartupDisabledByUser
source: Disabled in Task Manager
ar_sa: معطل من مدير المهام (Task Manager)
fr_fr: Désactivé dans le Gestionnaire des tâches

# Settings_StartupDisabledByPolicy
source: Disabled by group policy
ar_sa: معطل بسياسة المسؤول
fr_fr: Désactivé par la stratégie administrateur

# Result_StudentAction
source: Student Handout
ar_sa: نسخة التلميذ
fr_fr: Version Élève

# Result_TeacherAction
source: Teacher Key
ar_sa: عناصر الإجابة
fr_fr: Corrigé Enseignant

# Result_DefaultPdfFilter
source: PDF Document (*.pdf)
ar_sa: مستند PDF (*.pdf)
fr_fr: Document PDF (*.pdf)

# Result_DefaultDocxFilter
source: Word Document (*.docx)
ar_sa: مستند Word (*.docx)
fr_fr: Document Word (*.docx)

# Result_DefaultRtfFilter
source: RTF Document (*.rtf)
ar_sa: مستند RTF (*.rtf)
fr_fr: Document RTF (*.rtf)

# PDZ_ChapterCombo.Header
source: Guide Chapter (table of contents)
ar_sa: فصل الدليل (جدول المحتويات)
fr_fr: Chapitre du guide (table des matières)

# PDZ_ChapterCombo.PlaceholderText
source: Choose a chapter to prefill topic…
ar_sa: اختر فصلاً لتعبئة الموضوع مسبقاً…
fr_fr: Choisir un chapitre pour préremplir le sujet…

# PDZ_ChapterCombo.AutomationProperties.Name
source: Pedagogical guide chapter
ar_sa: فصل الدليل البيداغوجي
fr_fr: Chapitre du guide pédagogique

# PDZ_ChapterNote.Text
source: From table of contents cache — selecting prefills the topic.
ar_sa: مستخرج من ذاكرة الفهرس — التحديد يعبئ الموضوع تلقائياً.
fr_fr: Issu du cache de la table des matières — la sélection préremplit le sujet.

# SP_RefreshPreviewBtn.Text
source: Refresh
ar_sa: تحديث
fr_fr: Actualiser

# AD_Dialog.CloseButtonText
source: Close
ar_sa: إغلاق
fr_fr: Fermer

# CTA_ShortcutBusy.Text
source: Esc
fr_fr: Échap

# AD_Email.PlaceholderText
source: teacher@school.edu
fr_fr: enseignant@ac-academie.fr

# AD_SignInEmail.PlaceholderText
source: teacher@school.edu
fr_fr: enseignant@ac-academie.fr
